tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/device/periph/PERI_NETC_SW_ENETC.h
/*! @name VLANIPVMPR1 - VLAN to IPV mapping profile 0 register 1..VLAN to IPV mapping profile 1 register 1 */
/*! @{ */

#define NETC_SW_ENETC_VLANIPVMPR1_PCP_DEI_8_MASK (0x7U)
#define NETC_SW_ENETC_VLANIPVMPR1_PCP_DEI_8_SHIFT (0U)
#define NETC_SW_ENETC_VLANIPVMPR1_PCP_DEI_8(x)   (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_VLANIPVMPR1_PCP_DEI_8_SHIFT)) & NETC_SW_ENETC_VLANIPVMPR1_PCP_DEI_8_MASK)

#define NETC_SW_ENETC_VLANIPVMPR1_PCP_DEI_9_MASK (0x70U)
#define NETC_SW_ENETC_VLANIPVMPR1_PCP_DEI_9_SHIFT (4U)
#define NETC_SW_ENETC_VLANIPVMPR1_PCP_DEI_9(x)   (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_VLANIPVMPR1_PCP_DEI_9_SHIFT)) & NETC_SW_ENETC_VLANIPVMPR1_PCP_DEI_9_MASK)

#define NETC_SW_ENETC_VLANIPVMPR1_PCP_DEI_10_MASK (0x700U)
#define NETC_SW_ENETC_VLANIPVMPR1_PCP_DEI_10_SHIFT (8U)
#define NETC_SW_ENETC_VLANIPVMPR1_PCP_DEI_10(x)  (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_VLANIPVMPR1_PCP_DEI_10_SHIFT)) & NETC_SW_ENETC_VLANIPVMPR1_PCP_DEI_10_MASK)

#define NETC_SW_ENETC_VLANIPVMPR1_PCP_DEI_11_MASK (0x7000U)
#define NETC_SW_ENETC_VLANIPVMPR1_PCP_DEI_11_SHIFT (12U)
#define NETC_SW_ENETC_VLANIPVMPR1_PCP_DEI_11(x)  (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_VLANIPVMPR1_PCP_DEI_11_SHIFT)) & NETC_SW_ENETC_VLANIPVMPR1_PCP_DEI_11_MASK)

#define NETC_SW_ENETC_VLANIPVMPR1_PCP_DEI_12_MASK (0x70000U)
#define NETC_SW_ENETC_VLANIPVMPR1_PCP_DEI_12_SHIFT (16U)
#define NETC_SW_ENETC_VLANIPVMPR1_PCP_DEI_12(x)  (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_VLANIPVMPR1_PCP_DEI_12_SHIFT)) & NETC_SW_ENETC_VLANIPVMPR1_PCP_DEI_12_MASK)

#define NETC_SW_ENETC_VLANIPVMPR1_PCP_DEI_13_MASK (0x700000U)
#define NETC_SW_ENETC_VLANIPVMPR1_PCP_DEI_13_SHIFT (20U)
#define NETC_SW_ENETC_VLANIPVMPR1_PCP_DEI_13(x)  (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_VLANIPVMPR1_PCP_DEI_13_SHIFT)) & NETC_SW_ENETC_VLANIPVMPR1_PCP_DEI_13_MASK)

#define NETC_SW_ENETC_VLANIPVMPR1_PCP_DEI_14_MASK (0x7000000U)
#define NETC_SW_ENETC_VLANIPVMPR1_PCP_DEI_14_SHIFT (24U)
#define NETC_SW_ENETC_VLANIPVMPR1_PCP_DEI_14(x)  (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_VLANIPVMPR1_PCP_DEI_14_SHIFT)) & NETC_SW_ENETC_VLANIPVMPR1_PCP_DEI_14_MASK)

#define NETC_SW_ENETC_VLANIPVMPR1_PCP_DEI_15_MASK (0x70000000U)
#define NETC_SW_ENETC_VLANIPVMPR1_PCP_DEI_15_SHIFT (28U)
#define NETC_SW_ENETC_VLANIPVMPR1_PCP_DEI_15(x)  (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_VLANIPVMPR1_PCP_DEI_15_SHIFT)) & NETC_SW_ENETC_VLANIPVMPR1_PCP_DEI_15_MASK)
/*! @} */

/* The count of NETC_SW_ENETC_VLANIPVMPR1 */
#define NETC_SW_ENETC_VLANIPVMPR1_COUNT          (2U)

/*! @name VLANDRMPR - VLAN to DR mapping profile 0 register..VLAN to DR mapping profile 1 register */
/*! @{ */

#define NETC_SW_ENETC_VLANDRMPR_PCP_DEI_0_MASK   (0x3U)
#define NETC_SW_ENETC_VLANDRMPR_PCP_DEI_0_SHIFT  (0U)
#define NETC_SW_ENETC_VLANDRMPR_PCP_DEI_0(x)     (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_VLANDRMPR_PCP_DEI_0_SHIFT)) & NETC_SW_ENETC_VLANDRMPR_PCP_DEI_0_MASK)

#define NETC_SW_ENETC_VLANDRMPR_PCP_DEI_1_MASK   (0xCU)
#define NETC_SW_ENETC_VLANDRMPR_PCP_DEI_1_SHIFT  (2U)
#define NETC_SW_ENETC_VLANDRMPR_PCP_DEI_1(x)     (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_VLANDRMPR_PCP_DEI_1_SHIFT)) & NETC_SW_ENETC_VLANDRMPR_PCP_DEI_1_MASK)

#define NETC_SW_ENETC_VLANDRMPR_PCP_DEI_2_MASK   (0x30U)
#define NETC_SW_ENETC_VLANDRMPR_PCP_DEI_2_SHIFT  (4U)
#define NETC_SW_ENETC_VLANDRMPR_PCP_DEI_2(x)     (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_VLANDRMPR_PCP_DEI_2_SHIFT)) & NETC_SW_ENETC_VLANDRMPR_PCP_DEI_2_MASK)

#define NETC_SW_ENETC_VLANDRMPR_PCP_DEI_3_MASK   (0xC0U)
#define NETC_SW_ENETC_VLANDRMPR_PCP_DEI_3_SHIFT  (6U)
#define NETC_SW_ENETC_VLANDRMPR_PCP_DEI_3(x)     (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_VLANDRMPR_PCP_DEI_3_SHIFT)) & NETC_SW_ENETC_VLANDRMPR_PCP_DEI_3_MASK)

#define NETC_SW_ENETC_VLANDRMPR_PCP_DEI_4_MASK   (0x300U)
#define NETC_SW_ENETC_VLANDRMPR_PCP_DEI_4_SHIFT  (8U)
#define NETC_SW_ENETC_VLANDRMPR_PCP_DEI_4(x)     (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_VLANDRMPR_PCP_DEI_4_SHIFT)) & NETC_SW_ENETC_VLANDRMPR_PCP_DEI_4_MASK)

#define NETC_SW_ENETC_VLANDRMPR_PCP_DEI_5_MASK   (0xC00U)
#define NETC_SW_ENETC_VLANDRMPR_PCP_DEI_5_SHIFT  (10U)
#define NETC_SW_ENETC_VLANDRMPR_PCP_DEI_5(x)     (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_VLANDRMPR_PCP_DEI_5_SHIFT)) & NETC_SW_ENETC_VLANDRMPR_PCP_DEI_5_MASK)

#define NETC_SW_ENETC_VLANDRMPR_PCP_DEI_6_MASK   (0x3000U)
#define NETC_SW_ENETC_VLANDRMPR_PCP_DEI_6_SHIFT  (12U)
#define NETC_SW_ENETC_VLANDRMPR_PCP_DEI_6(x)     (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_VLANDRMPR_PCP_DEI_6_SHIFT)) & NETC_SW_ENETC_VLANDRMPR_PCP_DEI_6_MASK)

#define NETC_SW_ENETC_VLANDRMPR_PCP_DEI_7_MASK   (0xC000U)
#define NETC_SW_ENETC_VLANDRMPR_PCP_DEI_7_SHIFT  (14U)
#define NETC_SW_ENETC_VLANDRMPR_PCP_DEI_7(x)     (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_VLANDRMPR_PCP_DEI_7_SHIFT)) & NETC_SW_ENETC_VLANDRMPR_PCP_DEI_7_MASK)

#define NETC_SW_ENETC_VLANDRMPR_PCP_DEI_8_MASK   (0x30000U)
#define NETC_SW_ENETC_VLANDRMPR_PCP_DEI_8_SHIFT  (16U)
#define NETC_SW_ENETC_VLANDRMPR_PCP_DEI_8(x)     (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_VLANDRMPR_PCP_DEI_8_SHIFT)) & NETC_SW_ENETC_VLANDRMPR_PCP_DEI_8_MASK)

#define NETC_SW_ENETC_VLANDRMPR_PCP_DEI_9_MASK   (0xC0000U)
#define NETC_SW_ENETC_VLANDRMPR_PCP_DEI_9_SHIFT  (18U)
#define NETC_SW_ENETC_VLANDRMPR_PCP_DEI_9(x)     (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_VLANDRMPR_PCP_DEI_9_SHIFT)) & NETC_SW_ENETC_VLANDRMPR_PCP_DEI_9_MASK)

#define NETC_SW_ENETC_VLANDRMPR_PCP_DEI_10_MASK  (0x300000U)
#define NETC_SW_ENETC_VLANDRMPR_PCP_DEI_10_SHIFT (20U)
#define NETC_SW_ENETC_VLANDRMPR_PCP_DEI_10(x)    (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_VLANDRMPR_PCP_DEI_10_SHIFT)) & NETC_SW_ENETC_VLANDRMPR_PCP_DEI_10_MASK)

#define NETC_SW_ENETC_VLANDRMPR_PCP_DEI_11_MASK  (0xC00000U)
#define NETC_SW_ENETC_VLANDRMPR_PCP_DEI_11_SHIFT (22U)
#define NETC_SW_ENETC_VLANDRMPR_PCP_DEI_11(x)    (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_VLANDRMPR_PCP_DEI_11_SHIFT)) & NETC_SW_ENETC_VLANDRMPR_PCP_DEI_11_MASK)

#define NETC_SW_ENETC_VLANDRMPR_PCP_DEI_12_MASK  (0x3000000U)
#define NETC_SW_ENETC_VLANDRMPR_PCP_DEI_12_SHIFT (24U)
#define NETC_SW_ENETC_VLANDRMPR_PCP_DEI_12(x)    (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_VLANDRMPR_PCP_DEI_12_SHIFT)) & NETC_SW_ENETC_VLANDRMPR_PCP_DEI_12_MASK)

#define NETC_SW_ENETC_VLANDRMPR_PCP_DEI_13_MASK  (0xC000000U)
#define NETC_SW_ENETC_VLANDRMPR_PCP_DEI_13_SHIFT (26U)
#define NETC_SW_ENETC_VLANDRMPR_PCP_DEI_13(x)    (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_VLANDRMPR_PCP_DEI_13_SHIFT)) & NETC_SW_ENETC_VLANDRMPR_PCP_DEI_13_MASK)

#define NETC_SW_ENETC_VLANDRMPR_PCP_DEI_14_MASK  (0x30000000U)
#define NETC_SW_ENETC_VLANDRMPR_PCP_DEI_14_SHIFT (28U)
#define NETC_SW_ENETC_VLANDRMPR_PCP_DEI_14(x)    (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_VLANDRMPR_PCP_DEI_14_SHIFT)) & NETC_SW_ENETC_VLANDRMPR_PCP_DEI_14_MASK)

#define NETC_SW_ENETC_VLANDRMPR_PCP_DEI_15_MASK  (0xC0000000U)
#define NETC_SW_ENETC_VLANDRMPR_PCP_DEI_15_SHIFT (30U)
#define NETC_SW_ENETC_VLANDRMPR_PCP_DEI_15(x)    (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_VLANDRMPR_PCP_DEI_15_SHIFT)) & NETC_SW_ENETC_VLANDRMPR_PCP_DEI_15_MASK)
/*! @} */

