tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/device/periph/PERI_NETC_SW_ENETC.h
/*! @name SGCAPR - Stream gate capability register */
/*! @{ */

#define NETC_SW_ENETC_SGCAPR_GLC_AO_MASK         (0x1U)
#define NETC_SW_ENETC_SGCAPR_GLC_AO_SHIFT        (0U)
#define NETC_SW_ENETC_SGCAPR_GLC_AO(x)           (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_SGCAPR_GLC_AO_SHIFT)) & NETC_SW_ENETC_SGCAPR_GLC_AO_MASK)

#define NETC_SW_ENETC_SGCAPR_GLC_GC_MASK         (0x2U)
#define NETC_SW_ENETC_SGCAPR_GLC_GC_SHIFT        (1U)
#define NETC_SW_ENETC_SGCAPR_GLC_GC(x)           (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_SGCAPR_GLC_GC_SHIFT)) & NETC_SW_ENETC_SGCAPR_GLC_GC_MASK)

#define NETC_SW_ENETC_SGCAPR_GLC_IO_MASK         (0x4U)
#define NETC_SW_ENETC_SGCAPR_GLC_IO_SHIFT        (2U)
#define NETC_SW_ENETC_SGCAPR_GLC_IO(x)           (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_SGCAPR_GLC_IO_SHIFT)) & NETC_SW_ENETC_SGCAPR_GLC_IO_MASK)

#define NETC_SW_ENETC_SGCAPR_GLC_IPV_MASK        (0x8U)
#define NETC_SW_ENETC_SGCAPR_GLC_IPV_SHIFT       (3U)
#define NETC_SW_ENETC_SGCAPR_GLC_IPV(x)          (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_SGCAPR_GLC_IPV_SHIFT)) & NETC_SW_ENETC_SGCAPR_GLC_IPV_MASK)

#define NETC_SW_ENETC_SGCAPR_GLC_CTD_MASK        (0x10U)
#define NETC_SW_ENETC_SGCAPR_GLC_CTD_SHIFT       (4U)
#define NETC_SW_ENETC_SGCAPR_GLC_CTD(x)          (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_SGCAPR_GLC_CTD_SHIFT)) & NETC_SW_ENETC_SGCAPR_GLC_CTD_MASK)
/*! @} */

/*! @name SGIITCAPR - Stream gate instance index table capability register */
/*! @{ */

#define NETC_SW_ENETC_SGIITCAPR_NUM_ENTRIES_MASK (0xFFFFU)
#define NETC_SW_ENETC_SGIITCAPR_NUM_ENTRIES_SHIFT (0U)
#define NETC_SW_ENETC_SGIITCAPR_NUM_ENTRIES(x)   (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_SGIITCAPR_NUM_ENTRIES_SHIFT)) & NETC_SW_ENETC_SGIITCAPR_NUM_ENTRIES_MASK)

#define NETC_SW_ENETC_SGIITCAPR_ACCESS_METH_MASK (0xF00000U)
#define NETC_SW_ENETC_SGIITCAPR_ACCESS_METH_SHIFT (20U)
#define NETC_SW_ENETC_SGIITCAPR_ACCESS_METH(x)   (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_SGIITCAPR_ACCESS_METH_SHIFT)) & NETC_SW_ENETC_SGIITCAPR_ACCESS_METH_MASK)
/*! @} */

/*! @name SGIITMAR - Stream gate instance index table memory allocation register */
/*! @{ */

#define NETC_SW_ENETC_SGIITMAR_NUM_WORDS_MASK    (0xFFFFU)
#define NETC_SW_ENETC_SGIITMAR_NUM_WORDS_SHIFT   (0U)
#define NETC_SW_ENETC_SGIITMAR_NUM_WORDS(x)      (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_SGIITMAR_NUM_WORDS_SHIFT)) & NETC_SW_ENETC_SGIITMAR_NUM_WORDS_MASK)
/*! @} */

/*! @name SGIITOR - Stream gate instance index table operational register */
/*! @{ */

#define NETC_SW_ENETC_SGIITOR_NUM_ENTRIES_MASK   (0xFFFFU)
#define NETC_SW_ENETC_SGIITOR_NUM_ENTRIES_SHIFT  (0U)
#define NETC_SW_ENETC_SGIITOR_NUM_ENTRIES(x)     (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_SGIITOR_NUM_ENTRIES_SHIFT)) & NETC_SW_ENETC_SGIITOR_NUM_ENTRIES_MASK)
/*! @} */

/*! @name SGCLITCAPR - Stream gate control list index table capability register */
/*! @{ */

#define NETC_SW_ENETC_SGCLITCAPR_NUM_WORDS_MASK  (0xFFFFU)
#define NETC_SW_ENETC_SGCLITCAPR_NUM_WORDS_SHIFT (0U)
#define NETC_SW_ENETC_SGCLITCAPR_NUM_WORDS(x)    (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_SGCLITCAPR_NUM_WORDS_SHIFT)) & NETC_SW_ENETC_SGCLITCAPR_NUM_WORDS_MASK)

#define NETC_SW_ENETC_SGCLITCAPR_ACCESS_METH_MASK (0xF00000U)
#define NETC_SW_ENETC_SGCLITCAPR_ACCESS_METH_SHIFT (20U)
#define NETC_SW_ENETC_SGCLITCAPR_ACCESS_METH(x)  (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_SGCLITCAPR_ACCESS_METH_SHIFT)) & NETC_SW_ENETC_SGCLITCAPR_ACCESS_METH_MASK)
/*! @} */

/*! @name SGCLITMAR - Stream gate control list index table memory allocation register */
/*! @{ */

#define NETC_SW_ENETC_SGCLITMAR_NUM_WORDS_MASK   (0xFFFFU)
#define NETC_SW_ENETC_SGCLITMAR_NUM_WORDS_SHIFT  (0U)
#define NETC_SW_ENETC_SGCLITMAR_NUM_WORDS(x)     (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_SGCLITMAR_NUM_WORDS_SHIFT)) & NETC_SW_ENETC_SGCLITMAR_NUM_WORDS_MASK)
/*! @} */

/*! @name SGCLTMOR - Stream gate control list table memory operational register */
/*! @{ */

#define NETC_SW_ENETC_SGCLTMOR_NUM_WORDS_MASK    (0xFFFFU)
#define NETC_SW_ENETC_SGCLTMOR_NUM_WORDS_SHIFT   (0U)
#define NETC_SW_ENETC_SGCLTMOR_NUM_WORDS(x)      (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_SGCLTMOR_NUM_WORDS_SHIFT)) & NETC_SW_ENETC_SGCLTMOR_NUM_WORDS_MASK)
/*! @} */

/*! @name FMICAPR - Frame modification ingress capability register */
/*! @{ */

#define NETC_SW_ENETC_FMICAPR_L2_ACT_MASK        (0xFFU)
#define NETC_SW_ENETC_FMICAPR_L2_ACT_SHIFT       (0U)
/*! L2_ACT - Layer 2 frame modification actions supported */
#define NETC_SW_ENETC_FMICAPR_L2_ACT(x)          (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_FMICAPR_L2_ACT_SHIFT)) & NETC_SW_ENETC_FMICAPR_L2_ACT_MASK)
/*! @} */

/*! @name FMECAPR - Frame modification egress capability register */
/*! @{ */

#define NETC_SW_ENETC_FMECAPR_L2_ACT_MASK        (0xFFU)
#define NETC_SW_ENETC_FMECAPR_L2_ACT_SHIFT       (0U)
/*! L2_ACT - Layer 2 frame modification actions */
#define NETC_SW_ENETC_FMECAPR_L2_ACT(x)          (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_FMECAPR_L2_ACT_SHIFT)) & NETC_SW_ENETC_FMECAPR_L2_ACT_MASK)

#define NETC_SW_ENETC_FMECAPR_L3_ACT_MASK        (0xFF0000U)
#define NETC_SW_ENETC_FMECAPR_L3_ACT_SHIFT       (16U)
/*! L3_ACT - Layer 3 frame modification actions */
#define NETC_SW_ENETC_FMECAPR_L3_ACT(x)          (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_FMECAPR_L3_ACT_SHIFT)) & NETC_SW_ENETC_FMECAPR_L3_ACT_MASK)
/*! @} */

/*! @name FMITCAPR - Frame modification index table capability register */
/*! @{ */

#define NETC_SW_ENETC_FMITCAPR_NUM_ENTRIES_MASK  (0x1FFFU)
#define NETC_SW_ENETC_FMITCAPR_NUM_ENTRIES_SHIFT (0U)
#define NETC_SW_ENETC_FMITCAPR_NUM_ENTRIES(x)    (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_FMITCAPR_NUM_ENTRIES_SHIFT)) & NETC_SW_ENETC_FMITCAPR_NUM_ENTRIES_MASK)

#define NETC_SW_ENETC_FMITCAPR_ACCESS_METH_MASK  (0xF00000U)
#define NETC_SW_ENETC_FMITCAPR_ACCESS_METH_SHIFT (20U)
#define NETC_SW_ENETC_FMITCAPR_ACCESS_METH(x)    (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_FMITCAPR_ACCESS_METH_SHIFT)) & NETC_SW_ENETC_FMITCAPR_ACCESS_METH_MASK)
/*! @} */

/*! @name FMITMAR - Frame modification index table memory allocation register */
/*! @{ */

