tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/device/periph/PERI_NETC_SW_ENETC.h
#define NETC_SW_ENETC_FMITMAR_NUM_WORDS_MASK     (0x1FFFU)
#define NETC_SW_ENETC_FMITMAR_NUM_WORDS_SHIFT    (0U)
#define NETC_SW_ENETC_FMITMAR_NUM_WORDS(x)       (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_FMITMAR_NUM_WORDS_SHIFT)) & NETC_SW_ENETC_FMITMAR_NUM_WORDS_MASK)
/*! @} */

/*! @name FMITOR - Frame modification index table operational register */
/*! @{ */

#define NETC_SW_ENETC_FMITOR_NUM_ENTRIES_MASK    (0x1FFFU)
#define NETC_SW_ENETC_FMITOR_NUM_ENTRIES_SHIFT   (0U)
#define NETC_SW_ENETC_FMITOR_NUM_ENTRIES(x)      (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_FMITOR_NUM_ENTRIES_SHIFT)) & NETC_SW_ENETC_FMITOR_NUM_ENTRIES_MASK)
/*! @} */

/*! @name FMDITCAPR - Frame modification data index table capability register */
/*! @{ */

#define NETC_SW_ENETC_FMDITCAPR_NUM_WORDS_MASK   (0xFFFFU)
#define NETC_SW_ENETC_FMDITCAPR_NUM_WORDS_SHIFT  (0U)
#define NETC_SW_ENETC_FMDITCAPR_NUM_WORDS(x)     (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_FMDITCAPR_NUM_WORDS_SHIFT)) & NETC_SW_ENETC_FMDITCAPR_NUM_WORDS_MASK)

#define NETC_SW_ENETC_FMDITCAPR_ACCESS_METH_MASK (0xF00000U)
#define NETC_SW_ENETC_FMDITCAPR_ACCESS_METH_SHIFT (20U)
#define NETC_SW_ENETC_FMDITCAPR_ACCESS_METH(x)   (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_FMDITCAPR_ACCESS_METH_SHIFT)) & NETC_SW_ENETC_FMDITCAPR_ACCESS_METH_MASK)
/*! @} */

/*! @name FMDITMAR - Frame modification data index table memory allocation register */
/*! @{ */

#define NETC_SW_ENETC_FMDITMAR_NUM_WORDS_MASK    (0xFFFFU)
#define NETC_SW_ENETC_FMDITMAR_NUM_WORDS_SHIFT   (0U)
#define NETC_SW_ENETC_FMDITMAR_NUM_WORDS(x)      (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_FMDITMAR_NUM_WORDS_SHIFT)) & NETC_SW_ENETC_FMDITMAR_NUM_WORDS_MASK)
/*! @} */

/*! @name ETCAPR - Egress treatment capability register */
/*! @{ */

#define NETC_SW_ENETC_ETCAPR_ESQR_MASK           (0x1U)
#define NETC_SW_ENETC_ETCAPR_ESQR_SHIFT          (0U)
/*! ESQR - Egress Sequence Recovery supported */
#define NETC_SW_ENETC_ETCAPR_ESQR(x)             (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ETCAPR_ESQR_SHIFT)) & NETC_SW_ENETC_ETCAPR_ESQR_MASK)
/*! @} */

/*! @name ETTCAPR - Egress treatment table capability register */
/*! @{ */

#define NETC_SW_ENETC_ETTCAPR_NUM_ENTRIES_MASK   (0xFFFFU)
#define NETC_SW_ENETC_ETTCAPR_NUM_ENTRIES_SHIFT  (0U)
#define NETC_SW_ENETC_ETTCAPR_NUM_ENTRIES(x)     (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ETTCAPR_NUM_ENTRIES_SHIFT)) & NETC_SW_ENETC_ETTCAPR_NUM_ENTRIES_MASK)

#define NETC_SW_ENETC_ETTCAPR_ACCESS_METH_MASK   (0xF00000U)
#define NETC_SW_ENETC_ETTCAPR_ACCESS_METH_SHIFT  (20U)
#define NETC_SW_ENETC_ETTCAPR_ACCESS_METH(x)     (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ETTCAPR_ACCESS_METH_SHIFT)) & NETC_SW_ENETC_ETTCAPR_ACCESS_METH_MASK)
/*! @} */

/*! @name ETTOR - Egress treatment table operational register */
/*! @{ */

#define NETC_SW_ENETC_ETTOR_NUM_ENTRIES_MASK     (0xFFFFU)
#define NETC_SW_ENETC_ETTOR_NUM_ENTRIES_SHIFT    (0U)
#define NETC_SW_ENETC_ETTOR_NUM_ENTRIES(x)       (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ETTOR_NUM_ENTRIES_SHIFT)) & NETC_SW_ENETC_ETTOR_NUM_ENTRIES_MASK)
/*! @} */

/*! @name TGSTCAPR - Time gate scheduling table capability register */
/*! @{ */

#define NETC_SW_ENETC_TGSTCAPR_NUM_WORDS_MASK    (0xFFFFU)
#define NETC_SW_ENETC_TGSTCAPR_NUM_WORDS_SHIFT   (0U)
/*! NUM_WORDS - Number of Words */
#define NETC_SW_ENETC_TGSTCAPR_NUM_WORDS(x)      (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_TGSTCAPR_NUM_WORDS_SHIFT)) & NETC_SW_ENETC_TGSTCAPR_NUM_WORDS_MASK)

#define NETC_SW_ENETC_TGSTCAPR_ACCESS_METH_MASK  (0xF00000U)
#define NETC_SW_ENETC_TGSTCAPR_ACCESS_METH_SHIFT (20U)
/*! ACCESS_METH - Access Method
 *  0b1xxx..
 *  0bx1xx..Search
 *  0bxx1x..EntryId
 *  0bxxx1..Index
 */
#define NETC_SW_ENETC_TGSTCAPR_ACCESS_METH(x)    (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_TGSTCAPR_ACCESS_METH_SHIFT)) & NETC_SW_ENETC_TGSTCAPR_ACCESS_METH_MASK)

#define NETC_SW_ENETC_TGSTCAPR_MAX_GCL_LEN_MASK  (0x3000000U)
#define NETC_SW_ENETC_TGSTCAPR_MAX_GCL_LEN_SHIFT (24U)
/*! MAX_GCL_LEN - Maximum Gate Control List Length
 *  0b00..64
 *  0b01..128
 *  0b10..256
 *  0b11..
 */
#define NETC_SW_ENETC_TGSTCAPR_MAX_GCL_LEN(x)    (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_TGSTCAPR_MAX_GCL_LEN_SHIFT)) & NETC_SW_ENETC_TGSTCAPR_MAX_GCL_LEN_MASK)
/*! @} */

/*! @name TGSTMOR - Time gate scheduling table memory operation register */
/*! @{ */

#define NETC_SW_ENETC_TGSTMOR_NUM_WORDS_MASK     (0xFFFFU)
#define NETC_SW_ENETC_TGSTMOR_NUM_WORDS_SHIFT    (0U)
#define NETC_SW_ENETC_TGSTMOR_NUM_WORDS(x)       (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_TGSTMOR_NUM_WORDS_SHIFT)) & NETC_SW_ENETC_TGSTMOR_NUM_WORDS_MASK)
/*! @} */

/*! @name ESQRCAPR - Egress sequence recovery capability register */
/*! @{ */

#define NETC_SW_ENETC_ESQRCAPR_SQR_TYPE_MASK     (0x3U)
#define NETC_SW_ENETC_ESQRCAPR_SQR_TYPE_SHIFT    (0U)
#define NETC_SW_ENETC_ESQRCAPR_SQR_TYPE(x)       (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ESQRCAPR_SQR_TYPE_SHIFT)) & NETC_SW_ENETC_ESQRCAPR_SQR_TYPE_MASK)

#define NETC_SW_ENETC_ESQRCAPR_SQR_ALG_MASK      (0xCU)
#define NETC_SW_ENETC_ESQRCAPR_SQR_ALG_SHIFT     (2U)
#define NETC_SW_ENETC_ESQRCAPR_SQR_ALG(x)        (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ESQRCAPR_SQR_ALG_SHIFT)) & NETC_SW_ENETC_ESQRCAPR_SQR_ALG_MASK)

#define NETC_SW_ENETC_ESQRCAPR_SQR_MAX_HL_MASK   (0x700U)
#define NETC_SW_ENETC_ESQRCAPR_SQR_MAX_HL_SHIFT  (8U)
#define NETC_SW_ENETC_ESQRCAPR_SQR_MAX_HL(x)     (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ESQRCAPR_SQR_MAX_HL_SHIFT)) & NETC_SW_ENETC_ESQRCAPR_SQR_MAX_HL_MASK)
/*! @} */

/*! @name ESQRTCAPR - Egress sequence recovery table capability register */
/*! @{ */

#define NETC_SW_ENETC_ESQRTCAPR_NUM_ENTRIES_MASK (0xFFFFU)
#define NETC_SW_ENETC_ESQRTCAPR_NUM_ENTRIES_SHIFT (0U)
#define NETC_SW_ENETC_ESQRTCAPR_NUM_ENTRIES(x)   (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ESQRTCAPR_NUM_ENTRIES_SHIFT)) & NETC_SW_ENETC_ESQRTCAPR_NUM_ENTRIES_MASK)

