tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/device/periph/PERI_NETC_SW_ENETC.h
#define NETC_SW_ENETC_ESQRTCAPR_ACCESS_METH_MASK (0xF00000U)
#define NETC_SW_ENETC_ESQRTCAPR_ACCESS_METH_SHIFT (20U)
#define NETC_SW_ENETC_ESQRTCAPR_ACCESS_METH(x)   (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ESQRTCAPR_ACCESS_METH_SHIFT)) & NETC_SW_ENETC_ESQRTCAPR_ACCESS_METH_MASK)
/*! @} */

/*! @name ECTCAPR - Egress counter table capability register */
/*! @{ */

#define NETC_SW_ENETC_ECTCAPR_NUM_ENTRIES_MASK   (0xFFFFU)
#define NETC_SW_ENETC_ECTCAPR_NUM_ENTRIES_SHIFT  (0U)
#define NETC_SW_ENETC_ECTCAPR_NUM_ENTRIES(x)     (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ECTCAPR_NUM_ENTRIES_SHIFT)) & NETC_SW_ENETC_ECTCAPR_NUM_ENTRIES_MASK)

#define NETC_SW_ENETC_ECTCAPR_ACCESS_METH_MASK   (0xF00000U)
#define NETC_SW_ENETC_ECTCAPR_ACCESS_METH_SHIFT  (20U)
#define NETC_SW_ENETC_ECTCAPR_ACCESS_METH(x)     (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ECTCAPR_ACCESS_METH_SHIFT)) & NETC_SW_ENETC_ECTCAPR_ACCESS_METH_MASK)
/*! @} */

/*! @name HTMCAPR - Hash table memory capability register */
/*! @{ */

#define NETC_SW_ENETC_HTMCAPR_NUM_WORDS_MASK     (0xFFFFU)
#define NETC_SW_ENETC_HTMCAPR_NUM_WORDS_SHIFT    (0U)
#define NETC_SW_ENETC_HTMCAPR_NUM_WORDS(x)       (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_HTMCAPR_NUM_WORDS_SHIFT)) & NETC_SW_ENETC_HTMCAPR_NUM_WORDS_MASK)

#define NETC_SW_ENETC_HTMCAPR_WORD_SIZE_MASK     (0x30000000U)
#define NETC_SW_ENETC_HTMCAPR_WORD_SIZE_SHIFT    (28U)
#define NETC_SW_ENETC_HTMCAPR_WORD_SIZE(x)       (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_HTMCAPR_WORD_SIZE_SHIFT)) & NETC_SW_ENETC_HTMCAPR_WORD_SIZE_MASK)

#define NETC_SW_ENETC_HTMCAPR_MLOC_MASK          (0xC0000000U)
#define NETC_SW_ENETC_HTMCAPR_MLOC_SHIFT         (30U)
#define NETC_SW_ENETC_HTMCAPR_MLOC(x)            (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_HTMCAPR_MLOC_SHIFT)) & NETC_SW_ENETC_HTMCAPR_MLOC_MASK)
/*! @} */

/*! @name HTMOR - Hash table memory operational register */
/*! @{ */

#define NETC_SW_ENETC_HTMOR_AMOUNT_MASK          (0xFFFFU)
#define NETC_SW_ENETC_HTMOR_AMOUNT_SHIFT         (0U)
#define NETC_SW_ENETC_HTMOR_AMOUNT(x)            (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_HTMOR_AMOUNT_SHIFT)) & NETC_SW_ENETC_HTMOR_AMOUNT_MASK)

#define NETC_SW_ENETC_HTMOR_WATERMARK_MASK       (0xFFFF0000U)
#define NETC_SW_ENETC_HTMOR_WATERMARK_SHIFT      (16U)
#define NETC_SW_ENETC_HTMOR_WATERMARK(x)         (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_HTMOR_WATERMARK_SHIFT)) & NETC_SW_ENETC_HTMOR_WATERMARK_MASK)
/*! @} */

/*! @name ISIDCAPR - Ingress stream identification capability register */
/*! @{ */

#define NETC_SW_ENETC_ISIDCAPR_NUM_KC_MASK       (0x3U)
#define NETC_SW_ENETC_ISIDCAPR_NUM_KC_SHIFT      (0U)
#define NETC_SW_ENETC_ISIDCAPR_NUM_KC(x)         (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ISIDCAPR_NUM_KC_SHIFT)) & NETC_SW_ENETC_ISIDCAPR_NUM_KC_MASK)

#define NETC_SW_ENETC_ISIDCAPR_NUM_PF_MASK       (0x1CU)
#define NETC_SW_ENETC_ISIDCAPR_NUM_PF_SHIFT      (2U)
#define NETC_SW_ENETC_ISIDCAPR_NUM_PF(x)         (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ISIDCAPR_NUM_PF_SHIFT)) & NETC_SW_ENETC_ISIDCAPR_NUM_PF_MASK)

#define NETC_SW_ENETC_ISIDCAPR_MAX_KSIZE_MASK    (0x1F00U)
#define NETC_SW_ENETC_ISIDCAPR_MAX_KSIZE_SHIFT   (8U)
#define NETC_SW_ENETC_ISIDCAPR_MAX_KSIZE(x)      (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ISIDCAPR_MAX_KSIZE_SHIFT)) & NETC_SW_ENETC_ISIDCAPR_MAX_KSIZE_MASK)

#define NETC_SW_ENETC_ISIDCAPR_UFT_MASK          (0x10000U)
#define NETC_SW_ENETC_ISIDCAPR_UFT_SHIFT         (16U)
#define NETC_SW_ENETC_ISIDCAPR_UFT(x)            (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ISIDCAPR_UFT_SHIFT)) & NETC_SW_ENETC_ISIDCAPR_UFT_MASK)

#define NETC_SW_ENETC_ISIDCAPR_ETHFT_MASK        (0x20000U)
#define NETC_SW_ENETC_ISIDCAPR_ETHFT_SHIFT       (17U)
#define NETC_SW_ENETC_ISIDCAPR_ETHFT(x)          (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ISIDCAPR_ETHFT_SHIFT)) & NETC_SW_ENETC_ISIDCAPR_ETHFT_MASK)
/*! @} */

/*! @name ISIDHTCAPR - Ingress stream identification hash table capability register */
/*! @{ */

#define NETC_SW_ENETC_ISIDHTCAPR_ACCESS_METH_MASK (0xF00000U)
#define NETC_SW_ENETC_ISIDHTCAPR_ACCESS_METH_SHIFT (20U)
#define NETC_SW_ENETC_ISIDHTCAPR_ACCESS_METH(x)  (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ISIDHTCAPR_ACCESS_METH_SHIFT)) & NETC_SW_ENETC_ISIDHTCAPR_ACCESS_METH_MASK)
/*! @} */

/*! @name ISIDKC0OR - Ingress stream identification key construction 0 operational register */
/*! @{ */

#define NETC_SW_ENETC_ISIDKC0OR_NUM_ENTRIES_MASK (0xFFFFU)
#define NETC_SW_ENETC_ISIDKC0OR_NUM_ENTRIES_SHIFT (0U)
#define NETC_SW_ENETC_ISIDKC0OR_NUM_ENTRIES(x)   (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ISIDKC0OR_NUM_ENTRIES_SHIFT)) & NETC_SW_ENETC_ISIDKC0OR_NUM_ENTRIES_MASK)

#define NETC_SW_ENETC_ISIDKC0OR_EN_MASK          (0x80000000U)
#define NETC_SW_ENETC_ISIDKC0OR_EN_SHIFT         (31U)
#define NETC_SW_ENETC_ISIDKC0OR_EN(x)            (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ISIDKC0OR_EN_SHIFT)) & NETC_SW_ENETC_ISIDKC0OR_EN_MASK)
/*! @} */

/*! @name ISIDKC0CR0 - Ingress stream identification key construction 0 configuration register 0 */
/*! @{ */

#define NETC_SW_ENETC_ISIDKC0CR0_VALID_MASK      (0x1U)
#define NETC_SW_ENETC_ISIDKC0CR0_VALID_SHIFT     (0U)
/*! VALID - Valid
 *  0b0..The entire key construction rule is not valid including any configuration payload key fields defined.
 *  0b1..The key construction rule is valid.
 */
#define NETC_SW_ENETC_ISIDKC0CR0_VALID(x)        (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ISIDKC0CR0_VALID_SHIFT)) & NETC_SW_ENETC_ISIDKC0CR0_VALID_MASK)

#define NETC_SW_ENETC_ISIDKC0CR0_PORTP_MASK      (0x2U)
#define NETC_SW_ENETC_ISIDKC0CR0_PORTP_SHIFT     (1U)
/*! PORTP
 *  0b0..Not present
 *  0b1..Present
 */
#define NETC_SW_ENETC_ISIDKC0CR0_PORTP(x)        (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ISIDKC0CR0_PORTP_SHIFT)) & NETC_SW_ENETC_ISIDKC0CR0_PORTP_MASK)

#define NETC_SW_ENETC_ISIDKC0CR0_SPMP_MASK       (0x4U)
#define NETC_SW_ENETC_ISIDKC0CR0_SPMP_SHIFT      (2U)
/*! SPMP - Switch Port Masquerading (flag) Present
 *  0b0..Not present
 *  0b1..Present
 */
#define NETC_SW_ENETC_ISIDKC0CR0_SPMP(x)         (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ISIDKC0CR0_SPMP_SHIFT)) & NETC_SW_ENETC_ISIDKC0CR0_SPMP_MASK)

#define NETC_SW_ENETC_ISIDKC0CR0_DMACP_MASK      (0x8U)
#define NETC_SW_ENETC_ISIDKC0CR0_DMACP_SHIFT     (3U)
/*! DMACP - Destination MAC (address) Present
 *  0b0..Not present
 *  0b1..Present
 */
#define NETC_SW_ENETC_ISIDKC0CR0_DMACP(x)        (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ISIDKC0CR0_DMACP_SHIFT)) & NETC_SW_ENETC_ISIDKC0CR0_DMACP_MASK)

